[
  {
    "title": "The Adventures of Ford Fairlane",
    "year": 1990,
    "cast": [
      "Andrew Dice Clay",
      "Wayne Newton",
      "Priscilla Presley",
      "Lauren Holly",
      "Maddie Corman",
      "Ed O'Neill",
      "Morris Day",
      "Tone Loc",
      "Gilbert Gottfried",
      "Robert Englund"
    ],
    "genres": [
      "Action",
      "Comedy",
      "Mystery"
    ],
    "href": "The_Adventures_of_Ford_Fairlane",
    "extract": "The Adventures of Ford Fairlane is a 1990 American action comedy mystery film directed by Renny Harlin and written by David Arnott, James Cappe, and Daniel Waters based on a story by Arnott and Cappe. The film stars comedian Andrew Dice Clay as the title character, Ford Fairlane, a \"Rock n' Roll Detective\", whose beat is the music industry in Los Angeles. True to his name, Ford drives a 1957 Ford Fairlane 500 Skyliner in the film.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/ac/Fordfairlaneposter.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384,
    "imdb":7.6
  },
  {
    "title": "After Dark, My Sweet",
    "year": 1990,
    "cast": [
      "Jason Patric",
      "Rachel Ward",
      "Bruce Dern"
    ],
    "extract": "After Dark, My Sweet is a 1990 American neo-noir crime thriller film directed by James Foley and starring Jason Patric, Bruce Dern, and Rachel Ward. It is based on the 1955 Jim Thompson novel of the same name.",
    "imdb":7.6
  },
  {
    "title": "Air America",
    "year": 1990,
    "cast": [
      "Mel Gibson",
      "Robert Downey, Jr.",
      "Nancy Travis"
    ],
    "genres": [
      "Action",
      "Comedy"
    ],
    "href": "Air_America_(film)",
    "extract": "Air America is a 1990 American action comedy film directed by Roger Spottiswoode and starring Mel Gibson and Robert Downey Jr. as Air America pilots flying missions in Laos during the Vietnam War. When the protagonists discover their aircraft is being used by government agents to smuggle heroin, they must avoid being framed as the drug-smugglers.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/11/Air_America_%28film%29.jpg",
    "thumbnail_width": 258,
    "thumbnail_height": 385,
    "imdb":7.6
  },
  {
    "title": "Alice",
    "year": 1990,
    "cast": [
      "Mia Farrow",
      "Joe Mantegna",
      "William Hurt",
      "Alec Baldwin"
    ],
    "genres": [
      "Comedy",
      "Fantasy",
      "Romance"
    ],
    "href": "Alice_(1990_film)",
    "extract": "Alice is a 1990 American fantasy romantic comedy film written and directed by Woody Allen and starring Mia Farrow, Joe Mantegna, and William Hurt. The film is a loose reworking of Federico Fellini's 1965 film Juliet of the Spirits.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e4/Alice_movie_poster.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 343,
    "imdb":7.6
  },
  {
    "title": "Almost an Angel",
    "year": 1990,
    "cast": [
      "Paul Hogan",
      "Elias Koteas",
      "Charlton Heston"
    ],
    "genres": [
      "Comedy",
      "Drama",
      "Fantasy"
    ],
    "href": "Almost_an_Angel",
    "extract": "Almost an Angel is a 1990 American fantasy comedy-drama film directed by John Cornell and starring Paul Hogan. The original music score was composed by Maurice Jarre.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f7/Almost_an_angel_film.jpg",
    "thumbnail_width": 261,
    "thumbnail_height": 381,
    "imdb":7.6
  },
  {
    "title": "The Ambulance",
    "year": 1990,
    "cast": [
      "Eric Roberts",
      "James Earl Jones",
      "Megan Gallagher"
    ],
    "genres": [
      "Thriller",
      "Comedy"
    ],
    "href": "The_Ambulance",
    "extract": "The Ambulance is a 1990 American comedy thriller film written and directed by Larry Cohen. It stars Eric Roberts, Megan Gallagher, James Earl Jones, Janine Turner, Red Buttons, and Eric Braeden as the Doctor. Kevin Hagen plays a cop. In his first film role, Stan Lee of Marvel Comics has a small role as himself.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/70/The-Ambulance.jpg",
    "thumbnail_width": 258,
    "thumbnail_height": 386,
    "imdb":7.6
  },
  {
    "title": "American Dream",
    "year": 1990,
    "cast": [
      "proposed strike at",
      "Hormel Foods"
    ],
    "genres": [
      "Documentary"
    ],
    "href": "American_Dream_(film)",
    "extract": "American Dream is a 1990 British-American cinéma vérité documentary film directed by Barbara Kopple and co-directed by Cathy Caplan, Thomas Haneke, and Lawrence Silk.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/7c/American_Dream_%28film%29.jpg",
    "thumbnail_width": 248,
    "thumbnail_height": 353,
    "imdb":7.6
  },
  {
    "title": "American Ninja 4: The Annihilation",
    "year": 1990,
    "cast": [
      "Michael Dudikoff",
      "David Bradley"
    ],
    "genres": [
      "Martial Arts",
      "Action"
    ],
    "href": "American_Ninja_4:_The_Annihilation",
    "extract": "American Ninja 4: The Annihilation is a 1991 American martial arts action film starring Michael Dudikoff, David Bradley, and James Booth. A sequel to American Ninja 3: Blood Hunt (1989), it is the fourth installment in the American Ninja franchise, followed by American Ninja V and was directed by Cedric Sundstrom. The film marked Michael Dudikoff's final appearance in the American Ninja franchise.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/0d/Americanninja4.jpg",
    "thumbnail_width": 248,
    "thumbnail_height": 386,
    "imdb":7.6
  },
  {
    "title": "Andre's Mother",
    "year": 1990,
    "cast": [
      "Richard Thomas",
      "Sada Thompson"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Andre%27s_Mother",
    "extract": "Andre's Mother is a 1990 American made-for-television drama film written by Terrence McNally, adapted from his 1988 stage play, directed by Deborah Reinisch and starring Richard Thomas, Sada Thompson, and Sylvia Sidney. It was broadcast on the PBS television program American Playhouse on March 7, 1990.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/95/AndresMother.JPG",
    "thumbnail_width": 179,
    "thumbnail_height": 251,
    "imdb":7.6
  },
  {
    "title": "Angel Town",
    "year": 1990,
    "cast": [
      "Olivier Gruner",
      "Theresa Saldana"
    ],
    "genres": [
      "Action",
      "Martial Arts"
    ],
    "href": "Angel_Town_(film)",
    "extract": "Angel Town is a 1990 martial arts film directed by Eric Karson and starring Olivier Gruner, who made his film debut as a French martial artist and foreign exchange student who helps his borders by using his skills against a local gang.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/7c/Angel_town_movie_cover.jpg",
    "thumbnail_width": 244,
    "thumbnail_height": 409,
    "imdb":7.6
  },
  {
    "title": "Another 48 Hrs.",
    "year": 1990,
    "cast": [
      "Eddie Murphy",
      "Nick Nolte",
      "Brion James"
    ],
    "genres": [
      "Action"
    ],
    "href": "Another_48_Hrs.",
    "extract": "Another 48 Hrs. is a 1990 American buddy cop film directed by Walter Hill and starring Eddie Murphy, Nick Nolte, Brion James, Andrew Divoff, and Ed O'Ross. It is the sequel to the 1982 film 48 Hrs. Nolte reprises his role as San Francisco police officer Jack Cates, who has 48 hours to clear his name from a manslaughter charge. To do so, he again needs the help of Reggie Hammond (Murphy), who is a newly released convict. At the same time, a mastermind known only as the Iceman has hired a biker gang to kill Reggie.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/00/Another_forty_eight_hours.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "Arachnophobia",
    "year": 1990,
    "cast": [
      "Jeff Daniels",
      "John Goodman",
      "Harley Jane Kozak",
      "Julian Sands"
    ],
    "genres": [
      "Thriller",
      "Comedy",
      "Horror"
    ],
    "href": "Arachnophobia_(film)",
    "extract": "Arachnophobia is a 1990 American horror comedy film directed by Frank Marshall in his directorial debut from a screenplay by Don Jakoby and Wesley Strick. Starring Jeff Daniels and John Goodman, the film follows a small California town that becomes invaded by an aggressive and dangerous spider species. Its title refers to the fear of spiders.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a0/Arachnophobia_%28film%29_POSTER.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "Avalon",
    "year": 1990,
    "cast": [
      "Aidan Quinn",
      "Armin Mueller-Stahl",
      "Joan Plowright",
      "Elizabeth Perkins",
      "Kevin Pollak"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Avalon_(1990_film)",
    "extract": "Avalon is a 1990 American drama film written and directed by Barry Levinson and starring Armin Mueller-Stahl, Aidan Quinn, Elizabeth Perkins, Joan Plowright, and Elijah Wood. It is the third in Levinson's semi-autobiographical tetralogy of \"Baltimore films\" set in his hometown during the 1940s, 1950s, and 1960s: Diner (1982), Tin Men (1987), and Liberty Heights (1999). The film explores the themes of Jewish assimilation into American life, through several generations of a Polish immigrant family from the 1910s through the 1950s.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/ab/Avalon_poster.jpg",
    "thumbnail_width": 257,
    "thumbnail_height": 386,
    "imdb":7.6
  },
  {
    "title": "Awakenings",
    "year": 1990,
    "cast": [
      "Robert De Niro",
      "Robin Williams",
      "Penelope Ann Miller",
      "John Heard",
      "Julie Kavner",
      "Ruth Nelson"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Awakenings",
    "extract": "Awakenings is a 1990 American drama film directed by Penny Marshall. It is written by Steven Zaillian, who based his screenplay on Oliver Sacks's 1973 memoir Awakenings. It tells the story of neurologist Dr. Malcolm Sayer, who is based on Sacks, who discovers the beneficial effects of the drug L-DOPA in 1969. He administers it to catatonic patients who survived the 1917–1928 epidemic of encephalitis lethargica. Leonard Lowe and the rest of the patients are awakened after decades and have to deal with a new life in a new time. Julie Kavner, Ruth Nelson, John Heard, Penelope Ann Miller, Peter Stormare, and Max von Sydow also star.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/2b/Awakenings.jpg",
    "thumbnail_width": 273,
    "thumbnail_height": 365,
    "imdb":7.6
  },
  {
    "title": "Back to the Future Part III",
    "year": 1990,
    "cast": [
      "Michael J. Fox",
      "Christopher Lloyd",
      "Mary Steenburgen",
      "Thomas F. Wilson"
    ],
    "genres": [
      "Science Fiction",
      "Western"
    ],
    "href": "Back_to_the_Future_Part_III",
    "extract": "Back to the Future Part III is a 1990 American science fiction Western film and the final installment of the Back to the Future trilogy. The film was directed by Robert Zemeckis, and stars Michael J. Fox, Christopher Lloyd, Mary Steenburgen, Thomas F. Wilson, and Lea Thompson. The film continues immediately following Back to the Future Part II (1989); while stranded in 1955 during his time travel adventures, Marty McFly (Fox) discovers that his friend Dr. Emmett \"Doc\" Brown (Lloyd), trapped in 1885, was killed by Buford \"Mad Dog\" Tannen (Wilson), Biff's great-grandfather. Marty travels to 1885 to rescue Doc and return once again to 1985, but matters are complicated when Doc falls in love with Clara Clayton (Steenburgen).",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4e/Back_to_the_Future_Part_III.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "Bad Influence",
    "year": 1990,
    "cast": [
      "Rob Lowe",
      "James Spader"
    ],
    "genres": [
      "Thriller"
    ],
    "href": "Bad_Influence_(film)",
    "extract": "Bad Influence is a 1990 American psychological thriller film directed by Curtis Hanson starring Rob Lowe and James Spader. In this noirish film, Spader plays a yuppie who meets a mysterious stranger (Lowe) who encourages him to explore his dark side. Bad Influence was the first original screenplay for which David Koepp received a sole screenplay credit. The film's villain is loosely based on a real person, a nomadic surfer who befriended executive producer Morrie Eisenman.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/cc/Bad_Influence_Film_Poster.jpg",
    "thumbnail_width": 252,
    "thumbnail_height": 396,
    "imdb":7.6
  },
  {
    "title": "Basket Case 2",
    "year": 1990,
    "cast": [
      "Annie Ross"
    ],
    "genres": [
      "Horror",
      "Comedy"
    ],
    "href": "Basket_Case_2",
    "extract": "Basket Case 2 is a 1990 American comedy horror film written and directed by Frank Henenlotter, and the sequel to the 1982 film Basket Case. It stars Kevin Van Hentenryck as Duane Bradley, who moves with his deformed, formerly conjoined twin brother Belial into a home for \"unique individuals\" run by their long-lost aunt, eccentric philanthropist Granny Ruth.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a3/Basketcase2.jpg",
    "thumbnail_width": 274,
    "thumbnail_height": 362,
    "imdb":7.6
  },
  {
    "title": "Betsy's Wedding",
    "year": 1990,
    "cast": [
      "Alan Alda",
      "Molly Ringwald",
      "Ally Sheedy",
      "Madeline Kahn",
      "Joe Pesci",
      "Anthony LaPaglia",
      "Catherine O'Hara"
    ],
    "genres": [
      "Comedy",
      "Romance"
    ],
    "href": "Betsy%27s_Wedding",
    "extract": "Betsy's Wedding is a 1990 American romantic comedy film written and directed by Alan Alda. The film stars Alda, Joey Bishop, Madeline Kahn, Catherine O'Hara, Joe Pesci, Ally Sheedy, Bibi Besch, Burt Young, and Molly Ringwald. It was theatrically released in the United States on June 22, 1990, by Buena Vista Pictures Distribution.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/05/Betsy%27s_Wedding.jpg",
    "thumbnail_width": 255,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "102 Dalmatians",
    "year": 2000,
    "cast": [
      "Glenn Close",
      "Gérard Depardieu",
      "Alice Evans"
    ],
    "genres": [
      "Comedy",
      "Family",
      "Crime"
    ],
    "href": "102_Dalmatians",
    "extract": "102 Dalmatians is a 2000 American crime comedy film directed by Kevin Lima and produced by Edward S. Feldman and Walt Disney Pictures. The sequel to the 1996 film 101 Dalmatians, a live-action remake of the 1961 Disney animated film of the same name, it stars Glenn Close reprising her role as Cruella de Vil as she attempts to steal puppies for her \"grandest\" fur coat yet. Glenn Close and Tim McInnerny were the only two actors from the 1996 film to return for the sequel. The film received generally negative reviews from critics and was unable to achieve the box office success of its predecessor, although the film was nominated for the Academy Award for Best Costume Design.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fe/102_dalmatians_poster.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 327,
    "imdb":7.6
  },
  {
    "title": "28 Days",
    "year": 2000,
    "cast": [
      "Sandra Bullock",
      "Viggo Mortensen"
    ],
    "genres": [
      "Drama",
      "Comedy"
    ],
    "href": "28_Days_(film)",
    "extract": "28 Days is a 2000 American comedy-drama film directed by Betty Thomas and written by Susannah Grant. Sandra Bullock stars as Gwen Cummings, a newspaper columnist obliged to enter rehabilitation for alcoholism. The film costars Viggo Mortensen, Dominic West, Elizabeth Perkins, Azura Skye, Steve Buscemi, and Diane Ladd.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f7/28_Days_Poster.jpg",
    "thumbnail_width": 238,
    "thumbnail_height": 360,
    "imdb":7.6
  },
  {
    "title": "3 Strikes",
    "year": 2000,
    "cast": [
      "Brian Hooks",
      "N'Bushe Wright"
    ],
    "genres": [
      "Comedy"
    ],
    "href": "3_Strikes_(film)",
    "extract": "3 Strikes is a 2000 American comedy film written and directed by DJ Pooh, and starring Brian Hooks, N'Bushe Wright, Faizon Love and David Alan Grier. Despite some commercial success, it was negatively received by critics. The title refers to California's habitual offender law, whereby three convictions confer an automatic life sentence.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/db/3_Strikes_Poster.jpg",
    "thumbnail_width": 225,
    "thumbnail_height": 333,
    "imdb":7.6
  },
  {
    "title": "The 6th Day",
    "year": 2000,
    "cast": [
      "Arnold Schwarzenegger",
      "Robert Duvall",
      "Michael Rooker",
      "Tony Goldwyn",
      "Michael Rapaport",
      "Sarah Wynter",
      "Rodney Rowland",
      "Wendy Crewson",
      "Terry Crews"
    ],
    "genres": [
      "Science Fiction",
      "Action"
    ],
    "href": "The_6th_Day",
    "extract": "The 6th Day is a 2000 American science fiction action film directed by Roger Spottiswoode and starring Arnold Schwarzenegger, Tony Goldwyn, Michael Rapaport, and Robert Duvall. In the film, a family man of the future is illegally cloned by accident as part of a vast conspiracy involving a shady billionaire businessman, and is thrust into a struggle to clear his name and protect his family from the conspirators who seek to keep the cloning a secret. The title refers to the Judeo-Christian Genesis creation narrative, where God created mankind on the sixth day. The film was Terry Crews' acting debut.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a0/The_6th_Day_%282000_film%29.jpg",
    "thumbnail_width": 257,
    "thumbnail_height": 387,
    "imdb":7.6
  },
  {
    "title": "Across the Line",
    "year": 2000,
    "cast": [
      "Brad Johnson",
      "Adrienne Barbeau",
      "Brian Bloom"
    ],
    "genres": [
      "Thriller",
      "Western"
    ],
    "href": "Across_the_Line_(2000_film)",
    "extract": "Across the Line is a 2000 American Neo-Western film directed by Martin Spottl and starring Brad Johnson and Sigal Erez. Johnson plays a small-town Texas sheriff who falls for an illegal immigrant (Erez) who witnessed a murder on the Mexican border. While not an overtly political film, Across the Line portrays illegal immigrants in a generally positive light and dramatizes their motivations and problems from a sympathetic point of view. In La Opinion Jean Rodriguez Flores wrote, \"The film Across the Line isn't just about the difficulties of crossing illegally into the United States, but it also reflects the tragedy of hundreds of people who are forced to leave their families for the \"promised land.\" Some critics praised the film for its emotional intensity, authenticity, and integrity, but others questioned it for turning the plight of illegal immigrants into mainstream entertainment. Independently financed and produced, Across the Line was distributed by Lionsgate Entertainment.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/49/Across_the_Line.jpg",
    "thumbnail_width": 246,
    "thumbnail_height": 345,
    "imdb":7.6
  },
  {
    "title": "Adventures in Wild California",
    "year": 2000,
    "cast": [
      "Jimmy Smits",
      "(Narrator)"
    ],
    "genres": [
      "Documentary"
    ],
    "href": "Adventures_in_Wild_California",
    "extract": "Adventures in Wild California is a documentary film showcasing the scenery and extreme sports found in California. It is narrated by Jimmy Smits and was released to IMAX theaters in 2000. The film is directed by Greg MacGillivray and features songs by musician Lindsey Buckingham.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e9/Adventuresinwildcalifornia.jpg",
    "thumbnail_width": 234,
    "thumbnail_height": 425,
    "imdb":7.6
  },
  {
    "title": "The Adventures of Rocky and Bullwinkle",
    "year": 2000,
    "cast": [
      "Rene Russo",
      "Jason Alexander",
      "Robert De Niro",
      "Piper Perabo",
      "June Foray",
      "Keith Scott"
    ],
    "genres": [
      "Comedy",
      "Live Action",
      "Adventure",
      "Animated"
    ],
    "href": "The_Adventures_of_Rocky_and_Bullwinkle_(film)",
    "extract": "The Adventures of Rocky and Bullwinkle is a 2000 American live-action/animated adventure slapstick comedy film directed by Des McAnuff and produced by Universal Pictures, based on the television cartoon of the same name by Jay Ward. Animated characters Rocky and Bullwinkle share the screen with live actors portraying Fearless Leader, Boris Badenov and Natasha Fatale along with Randy Quaid, Piper Perabo, Kenan Thompson and Kel Mitchell. June Foray reprised her role as Rocky, while Keith Scott voiced Bullwinkle and the film's narrator. It also features cameo appearances by performers including James Rebhorn, Paget Brewster, Janeane Garofalo, John Goodman, David Alan Grier, Don Novello, Jon Polito, Carl Reiner, Whoopi Goldberg, Max Grodenchik, Norman Lloyd, Jonathan Winters and Billy Crystal. The film follows a young rookie FBI agent named Karen Sympathy enlisting the help of Rocky and Bullwinkle to stop Boris, Natasha, and Fearless Leader from taking over the United States.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/78/Adventuresofrockyandbullwinklemovieposter.jpg",
    "thumbnail_width": 269,
    "thumbnail_height": 370,
    "imdb":7.6
  },
  {
    "title": "All the Pretty Horses",
    "year": 2000,
    "cast": [
      "Matt Damon",
      "Penélope Cruz",
      "Henry Thomas",
      "Lucas Black",
      "Rubén Blades",
      "Míriam Colón",
      "Bruce Dern"
    ],
    "genres": [
      "Western"
    ],
    "href": "All_the_Pretty_Horses_(film)",
    "extract": "All the Pretty Horses is a 2000 American Western film produced and directed by Billy Bob Thornton, based on Cormac McCarthy's novel of the same name, and starring Matt Damon and Penélope Cruz. It premiered on December 25, 2000 to mostly negative reviews. It grossed $18 million worldwide on a $57 million budget.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b0/All_the_Pretty_Horses_Poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 385,
    "imdb":7.6
  },
  {
    "title": "Almost Famous",
    "year": 2000,
    "cast": [
      "Billy Crudup",
      "Frances McDormand",
      "Kate Hudson",
      "Jason Lee",
      "Patrick Fugit",
      "Anna Paquin",
      "Fairuza Balk"
    ],
    "genres": [
      "Comedy",
      "Drama"
    ],
    "href": "Almost_Famous",
    "extract": "Almost Famous is a 2000 American comedy-drama film written and directed by Cameron Crowe, and starring Billy Crudup, Frances McDormand, Kate Hudson, and Patrick Fugit. It tells the story of a teenage journalist, played by Fugit, writing for Rolling Stone magazine in the early 1970s, touring with the fictitious rock band Stillwater, and writing his first cover story on the band. The film is semi-autobiographical, as Crowe himself was a teenage writer for Rolling Stone.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/dd/Almost_famous_poster1.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384,
    "imdb":7.6
  },
  {
    "title": "American Psycho",
    "year": 2000,
    "cast": [
      "Christian Bale",
      "Chloë Sevigny",
      "Willem Dafoe"
    ],
    "genres": [
      "Horror"
    ],
    "href": "American_Psycho_(film)",
    "extract": "American Psycho is a 2000 satirical horror film directed by Mary Harron, who co-wrote the screenplay with Guinevere Turner. Based on the 1991 novel by Bret Easton Ellis, it stars Christian Bale as Patrick Bateman, a New York City investment banker who leads a double life as a serial killer. Willem Dafoe, Jared Leto, Josh Lucas, Chloë Sevigny, Samantha Mathis, Cara Seymour, Justin Theroux, and Reese Witherspoon appear in supporting roles. The film blends horror and black comedy to satirize 1980s yuppie culture and consumerism, exemplified by Bateman and supporting cast.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/0c/American_Psycho.png",
    "thumbnail_width": 258,
    "thumbnail_height": 382,
    "imdb":7.6
  },
  {
    "title": "Animal Factory",
    "year": 2000,
    "cast": [
      "Willem Dafoe",
      "Edward Furlong",
      "Mickey Rourke"
    ],
    "genres": [
      "Noir"
    ],
    "href": "Animal_Factory",
    "extract": "Animal Factory is a 2000 neo-noir film directed by Steve Buscemi and starring Willem Dafoe, Edward Furlong, Danny Trejo, John Heard, Mickey Rourke, Tom Arnold, Seymour Cassel, Shell Galloway and Mark Boone, Jr. Set in San Quentin, the film is about life in prison. It is based on the novel of the same name by Eddie Bunker who plays the part of Buzzard in the film.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/88/AnimalFactory.jpg",
    "thumbnail_width": 258,
    "thumbnail_height": 385,
    "imdb":7.6
  },
  {
    "title": "The Art of War",
    "year": 2000,
    "cast": [
      "Wesley Snipes",
      "Donald Sutherland"
    ],
    "genres": [
      "Action",
      "Spy"
    ],
    "href": "The_Art_of_War_(film)",
    "extract": "The Art of War is a 2000 action spy film directed by Christian Duguay and starring Wesley Snipes, Michael Biehn, Anne Archer and Donald Sutherland. It is the first installment in The Art of War film series. The film's title refers to the ancient Chinese text of the same name by war strategist Sun Tzu. The film was followed by two direct-to-video sequels, The Art of War II: Betrayal and The Art of War III: Retribution. The latter did not feature Snipes.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a6/Art_of_war_poster.jpg",
    "thumbnail_width": 236,
    "thumbnail_height": 350,
    "imdb":7.6
  },
  {
    "title": "Autumn in New York",
    "year": 2000,
    "cast": [
      "Richard Gere",
      "Winona Ryder"
    ],
    "genres": [
      "Romance",
      "Drama"
    ],
    "href": "Autumn_in_New_York_(film)",
    "extract": "Autumn in New York is a 2000 American romantic drama film directed by Joan Chen and starring Richard Gere, Winona Ryder, and Anthony LaPaglia. Written by Allison Burnett, the film follows a successful middle-aged restaurateur and womanizer who falls in love with a sweet young woman who is terminally ill. United States distributor MGM took over the film from Chen and significantly re-edited the film, which also involved deleting a Winona Ryder nude scene. The film received generally negative reviews, but was a moderate commercial success, grossing $100 million on a $65 million budget.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/43/Autumnmovieposter.jpg",
    "thumbnail_width": 267,
    "thumbnail_height": 373,
    "imdb":7.6
  },
  {
    "title": "Bait",
    "year": 2000,
    "cast": [
      "Jamie Foxx",
      "David Morse",
      "Kimberly Elise"
    ],
    "genres": [
      "Action",
      "Comedy"
    ],
    "href": "Bait_(2000_film)",
    "extract": "Bait is a 2000 action comedy film starring Jamie Foxx and David Morse. It was directed by Antoine Fuqua. The film was a huge financial failure, costing Warner Bros. $51 million but only grossing approximately $15 million.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/44/Bait_2000_movie-poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 385,
    "imdb":7.6
  },
  {
    "title": "The Ballad of Ramblin' Jack",
    "year": 2000,
    "cast": [
      "Ramblin' Jack Elliott"
    ],
    "genres": [
      "Documentary"
    ],
    "href": null,
    "imdb":7.6
  },
  {
    "title": "Bamboozled",
    "year": 2000,
    "cast": [
      "Damon Wayans",
      "Jada Pinkett Smith",
      "Savion Glover",
      "Michael Rapaport",
      "Tommy Davidson"
    ],
    "genres": [
      "Satire",
      "Comedy",
      "Drama"
    ],
    "href": "Bamboozled",
    "extract": "Bamboozled is a 2000 American satirical dark comedy-drama film written and directed by Spike Lee about a modern televised minstrel show featuring black actors donning blackface makeup and the resulting violent fallout from the show's success. It features an ensemble cast including Damon Wayans, Jada Pinkett Smith, Savion Glover, Tommy Davidson, Michael Rapaport and Mos Def.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/d2/Bamboozled-2000-posterimg.jpg",
    "thumbnail_width": 252,
    "thumbnail_height": 394,
    "imdb":7.6
  },
  {
    "title": "Battlefield Earth",
    "year": 2000,
    "cast": [
      "John Travolta",
      "Forest Whitaker",
      "Barry Pepper"
    ],
    "genres": [
      "Science Fiction"
    ],
    "href": "Battlefield_Earth_(film)",
    "extract": "Battlefield Earth is a 2000 American science fiction film based on the 1982 novel by Scientology founder L. Ron Hubbard. It was directed by Roger Christian and stars John Travolta, Barry Pepper, and Forest Whitaker. The film follows a rebellion against the alien Psychlos, who have ruled Earth for 1,000 years.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/21/Battlefield_earth_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384,
    "imdb":7.6
  },
  {
    "title": "The Beach",
    "year": 2000,
    "cast": [
      "Leonardo DiCaprio",
      "Virginie Ledoyen",
      "Tilda Swinton"
    ],
    "genres": [
      "Adventure",
      "Drama"
    ],
    "href": "The_Beach_(film)",
    "extract": "The Beach is a 2000 adventure drama film directed by Danny Boyle, from a screenplay by John Hodge, based on the 1996 novel of the same name by Alex Garland. The film stars Leonardo DiCaprio, Tilda Swinton, Virginie Ledoyen, Guillaume Canet, and Robert Carlyle. It was filmed on the Thai island of Ko Phi Phi Le.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/bc/The_Beach_film.jpg",
    "thumbnail_width": 260,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "Winter Day Dreams ft. Franny's Feet and Olivia",
    "year": 2010,
    "cast": [
      "Franny's Feet",
      ")",
      "Phoebe McAuley",
      "George Buza",
      "Katherine Crimi",
      "Emily Gray"
    ],
    "genres": [
      "Animated",
      "Family"
    ],
    "href": "Franny's Feet",
    "extract": "Franny's Feet is a Canadian animated children's television series created by writer Cathy Moss and fellow Susin Nielsen. The series was produced by Decode Entertainment, in association with Channel Five Broadcasting Limited. The series follows the adventures of Frances \"Franny\" Fantootsie as she tries on a new shoe and travels to different countries.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/commons/2/23/Frannys_Feet_Logo.png",
    "thumbnail_width": 200,
    "thumbnail_height": 108,
    "imdb":7.6
  },
  {
    "title": "Garbage Dreams",
    "year": 2010,
    "cast": [],
    "genres": [
      "Documentary"
    ],
    "href": "Garbage_Dreams",
    "extract": "Garbage Dreams is a 2009 feature length documentary film produced and directed by Mai Iskander. Filmed over the course of four years, Garbage Dreams follows three teenage boys growing up in Egypt's garbage village. Garbage Dreams aired on the PBS program Independent Lens for the occasion of Earth Day 2010 and has been screened in many international film festivals.",
    "imdb":7.6
  },
  {
    "title": "Sweetgrass",
    "year": 2010,
    "cast": [],
    "genres": [
      "Documentary"
    ],
    "href": "Sweetgrass_(film)",
    "extract": "Sweetgrass is a 2009 documentary film that follows modern-day shepherds as they lead their flocks of sheep up into Montana's Absaroka-Beartooth mountains for summer pasture. It was directed by Lucien Castaing-Taylor, a Harvard anthropologist, and produced by his wife Ilisa Barbash. The title derives from Sweet Grass County, one of several in which the film was shot.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/62/SweetgrassPoster.jpg",
    "thumbnail_width": 260,
    "thumbnail_height": 384,
    "imdb":7.6
  },
  {
    "title": "Daybreakers",
    "year": 2010,
    "cast": [
      "Ethan Hawke",
      "Willem Dafoe",
      "Sam Neill",
      "Claudia Karvan",
      "Michael Dorman",
      "Isabel Lucas",
      "Vince Colosimo",
      "Jay Laga'aia"
    ],
    "genres": [
      "Action",
      "Horror",
      "Science Fiction"
    ],
    "href": "Daybreakers",
    "extract": "Daybreakers is a 2009 science-fiction action horror film written and directed by Michael and Peter Spierig. The film takes place in a futuristic world overrun by vampires, and centers around a vampiric corporation which sets out to capture and farm the remaining humans while researching a substitute for human blood. Ethan Hawke plays vampire hematologist Edward Dalton, whose work is interrupted by human survivors led by former vampire \"Elvis\", who has a cure that can save the human species.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b4/Daybreakers_ver2.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "Leap Year",
    "year": 2010,
    "cast": [
      "Amy Adams",
      "Matthew Goode",
      "Adam Scott",
      "John Lithgow",
      "Kaitlin Olson",
      "Noel O'Donovan",
      "Tony Rohr",
      "Pat Laffan",
      "Alan Devlin",
      "Ian McElhinney",
      "Vincenzo Nicoli",
      "Flaminia Cinque",
      "Peter O'Meara"
    ],
    "genres": [
      "Comedy",
      "Romance"
    ],
    "href": "Leap_Year_(2010_film)",
    "extract": "Leap Year is a 2010 romantic comedy directed by Anand Tucker and written by Harry Elfont and Deborah Kaplan. Leap Year stars Amy Adams and Matthew Goode.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/da/Leap_year_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "Youth in Revolt",
    "year": 2010,
    "cast": [
      "Michael Cera",
      "Portia Doubleday",
      "Justin Long",
      "Steve Buscemi",
      "Ray Liotta",
      "Jean Smart",
      "Zach Galifianakis",
      "Erik Knudsen",
      "Adhir Kalyan",
      "Fred Willard",
      "Ari Graynor",
      "Rooney Mara",
      "Jade Fusco",
      "M. Emmet Walsh",
      "Mary Kay Place",
      "Jonathan Bradford Wright",
      "Michael Collins"
    ],
    "genres": [
      "Comedy",
      "Drama",
      "Romance"
    ],
    "href": "Youth_in_Revolt_(film)",
    "extract": "Youth in Revolt is a 2009 American romantic comedy-drama film directed by Miguel Arteta and written by Gustin Nash. Based on C.D. Payne's epistolary novel of the same name, the film stars Michael Cera and Portia Doubleday, with Justin Long, Ray Liotta, and Steve Buscemi in supporting roles.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/94/Youth_in_Revolt_Poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "B*tch Slap",
    "year": 2010,
    "cast": [
      "Julia Voth",
      "Erin Cummings",
      "America Olivo",
      "Ron Melendez",
      "William Gregory Lee",
      "Minae Noji",
      "Michael Hurst"
    ],
    "genres": [
      "Action"
    ],
    "href": "Bitch_Slap",
    "extract": "Bitch Slap is a 2009 American action film directed by Rick Jacobson and starring Julia Voth, Erin Cummings, America Olivo and Michael Hurst, with cameos by Lucy Lawless, Kevin Sorbo, and Renee O'Connor.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/03/Bitch_slap_poster.jpg",
    "thumbnail_width": 260,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "Crazy on the Outside",
    "year": 2010,
    "cast": [
      "Tim Allen",
      "Sigourney Weaver",
      "Ray Liotta",
      "J.K. Simmons",
      "Julie Bowen",
      "Kelsey Grammer",
      "Jeanne Tripplehorn",
      "Kenton Duty",
      "Daniel Booko",
      "Karle Warren",
      "Robert Baker",
      "Casey Sander",
      "Jon Gries",
      "Malcolm Goodwin",
      "Rocky LaPorte",
      "Meeghan Holaway"
    ],
    "genres": [
      "Comedy"
    ],
    "href": "Crazy_on_the_Outside",
    "extract": "Crazy on the Outside is a 2010 American comedy film starring and directed by Tim Allen. The film marks Allen's feature film directorial debut, and is notable for reuniting Allen with co-stars from many of his previous films.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/56/Crazy_on_the_outside_poster.jpg",
    "thumbnail_width": 263,
    "thumbnail_height": 379,
    "imdb":7.6
  },
  {
    "title": "Waiting for Armageddon",
    "year": 2010,
    "cast": [],
    "genres": [
      "Documentary"
    ],
    "href": "Waiting_for_Armageddon",
    "extract": "Waiting for Armageddon is a 2009 American documentary film that studies Armageddon theology and Christian eschatology. Some evangelicals in the United States believe that bible prophecy predicts events including the rapture and the Battle of Armageddon. The documentary raises questions regarding how this theology shapes United States and Middle East relations and how it may encourage an international holy war.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/77/Waitingforarmageddom.jpg",
    "thumbnail_width": 200,
    "thumbnail_height": 284,
    "imdb":7.6
  },
  {
    "title": "Wonderful World",
    "year": 2010,
    "cast": [
      "Matthew Broderick",
      "Sanaa Lathan",
      "Michael K. Williams",
      "Jodelle Ferland",
      "Jesse Tyler Ferguson",
      "Ally Walker",
      "Philip Baker Hall"
    ],
    "genres": [
      "Comedy",
      "Drama"
    ],
    "href": "Wonderful_World_(2009_film)",
    "extract": "Wonderful World is a 2009 dark comedy-drama film written and directed by Joshua Goldin, and starring Matthew Broderick, Sanaa Lathan, Michael K. Williams, Jodelle Ferland, Jesse Tyler Ferguson, Ally Walker, and Philip Baker Hall. It is Goldin's directorial debut. The story revolves around a misanthropic, former children's folk singer having his life changed after his Senegalese roommate goes into a diabetic coma, and the sister who arrives to take care of him that he falls in love with.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f7/Wonderful_world_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "The Book of Eli",
    "year": 2010,
    "cast": [
      "Denzel Washington",
      "Gary Oldman",
      "Mila Kunis",
      "Ray Stevenson",
      "Jennifer Beals",
      "Evan Jones",
      "Joe Pingue",
      "Frances de la Tour",
      "Michael Gambon",
      "Tom Waits",
      "Chris Browning",
      "Malcolm McDowell"
    ],
    "genres": [
      "Action",
      "Western"
    ],
    "href": "The_Book_of_Eli",
    "extract": "The Book of Eli is a 2010 American post-apocalyptic neo-Western action film directed by the Hughes Brothers, written by Gary Whitta, and starring Denzel Washington, Gary Oldman, Mila Kunis, Ray Stevenson, and Jennifer Beals. The story revolves around Eli, a nomad in a post-apocalyptic world who seeks to deliver his copy of a mysterious book to a safe location on the West Coast of the United States. Filming began in February 2009 and took place in New Mexico.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e3/Book_of_eli_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "The Spy Next Door",
    "year": 2010,
    "cast": [
      "Jackie Chan",
      "Amber Valletta",
      "Magnús Scheving",
      "Billy Ray Cyrus",
      "George Lopez",
      "Lucas Till",
      "Katherine Boecher",
      "Madeline Carroll",
      "Alina Foley",
      "Will Shadley",
      "Jeff Chase",
      "Esodie Geiger"
    ],
    "genres": [
      "Action",
      "Comedy",
      "Spy"
    ],
    "href": "The_Spy_Next_Door",
    "extract": "The Spy Next Door is a 2010 American spy action comedy film directed by Brian Levant, written by Jonathan Bernstein, James Greer and Gregory Poirier, produced by Robert Simonds with music by David Newman. The film stars Jackie Chan, with a supporting cast of Amber Valletta, Magnús Scheving, Madeline Carroll, Will Shadley, Alina Foley, Billy Ray Cyrus and George Lopez. Filming started in late October 2008 in Rio Rancho, New Mexico and was finished in late December 2008. The film was released on January 15, 2010 in the United States by Lionsgate. The film was released on DVD, and Blu-ray on May 18, 2010. The film tributes Chan's films by showing clips, references and even referencing Chan's real life childhood. The film received negative reviews from critics and it earned $45.2 million on a $28 million budget.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/6d/Spy_next_door_ver2.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "44 Inch Chest",
    "year": 2010,
    "cast": [
      "Ray Winstone",
      "Ian McShane",
      "John Hurt",
      "Tom Wilkinson",
      "Stephen Dillane",
      "Joanne Whalley",
      "Melvil Poupaud",
      "Steven Berkoff",
      "Edna Doré",
      "Andy de la Tour",
      "Derek Lea"
    ],
    "genres": [
      "Comedy",
      "Crime",
      "Drama"
    ],
    "href": "44_Inch_Chest",
    "extract": "44 Inch Chest is a 2009 British crime comedy-drama film directed by Malcolm Venville in his directorial debut. The film stars Ray Winstone, Ian McShane, John Hurt, Tom Wilkinson, Stephen Dillane and Joanne Whalley. The film was released on 19 October 2009.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/a/aa/44_inch_chest_poster.jpg/320px-44_inch_chest_poster.jpg",
    "thumbnail_width": 320,
    "thumbnail_height": 240,
    "imdb":7.6
  },
  {
    "title": "The Grudge",
    "year": 2020,
    "cast": [
      "Andrea Riseborough",
      "Demián Bichir",
      "John Cho",
      "Betty Gilpin",
      "Lin Shaye",
      "Jacki Weaver"
    ],
    "genres": [
      "Horror",
      "Supernatural"
    ],
    "href": "The_Grudge_(2020_film)",
    "extract": "The Grudge is a 2020 American psychological supernatural horror film written and directed by Nicolas Pesce. Originally announced as a reboot of the 2004 American remake and the original 2002 Japanese horror film Ju-On: The Grudge, the film ended up taking place before and during the events of the 2004 film and its two direct sequels, and is the fourth installment in the American The Grudge film series. The film stars Andrea Riseborough, Demián Bichir, John Cho, Betty Gilpin, Lin Shaye, and Jacki Weaver, and follows a police officer who investigates several murders that are seemingly connected to a single house.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/34/The_Grudge_2020_Poster.jpeg",
    "thumbnail_width": 220,
    "thumbnail_height": 326,
    "imdb":7.6
  },
  {
    "title": "Underwater",
    "year": 2020,
    "cast": [
      "Kristen Stewart",
      "Vincent Cassel",
      "Jessica Henwick",
      "John Gallagher Jr.",
      "Mamoudou Athie",
      "T.J. Miller"
    ],
    "genres": [
      "Action",
      "Horror",
      "Science Fiction"
    ],
    "href": "Underwater_(film)",
    "extract": "Underwater is a 2020 American science fiction action horror film directed by William Eubank. The film stars Kristen Stewart, Vincent Cassel, Jessica Henwick, John Gallagher Jr., Mamoudou Athie, and T.J. Miller.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4a/Underwater_poster.jpeg",
    "thumbnail_width": 250,
    "thumbnail_height": 398,
    "imdb":7.6
  },
  {
    "title": "Like a Boss",
    "year": 2020,
    "cast": [
      "Tiffany Haddish",
      "Rose Byrne",
      "Salma Hayek",
      "Jennifer Coolidge",
      "Billy Porter"
    ],
    "genres": [
      "Comedy"
    ],
    "href": "Like_a_Boss_(film)",
    "extract": "Like a Boss is a 2020 American comedy film directed by Miguel Arteta, written by Sam Pitman and Adam Cole-Kelly, and starring Tiffany Haddish, Rose Byrne, and Salma Hayek. The plot follows two friends who attempt to take back control of their cosmetics company from an industry titan.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9a/LikeaBossPoster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "Three Christs",
    "year": 2020,
    "cast": [
      "Richard Gere",
      "Peter Dinklage",
      "Walton Goggins",
      "Bradley Whitford"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Three_Christs",
    "extract": "Three Christs, also known as State of Mind, is a 2017 American drama film directed, co-produced, and co-written by Jon Avnet and based on Milton Rokeach's nonfiction book The Three Christs of Ypsilanti. It screened in the Gala Presentations section at the 2017 Toronto International Film Festival. The film is also known as: Three Christs of Ypsilanti, The Three Christs of Ypsilanti, Three Christs of Santa Monica, and The Three Christs of Santa Monica.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a1/Three_Christs_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383,
    "imdb":7.6
  },
  {
    "title": "Inherit the Viper",
    "year": 2020,
    "cast": [
      "Josh Hartnett",
      "Margarita Levieva",
      "Chandler Riggs",
      "Bruce Dern",
      "Owen Teague"
    ],
    "genres": [
      "Crime",
      "Drama"
    ],
    "href": "Inherit_the_Viper",
    "extract": "Inherit the Viper is a 2019 American crime drama film directed by Anthony Jerjen, in his feature directorial debut, from a screenplay by Andrew Crabtree. It stars Josh Hartnett, Margarita Levieva, Chandler Riggs, Bruce Dern, Valorie Curry, Owen Teague, and Dash Mihok.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1c/Inherit_the_Viper_%282019%29_Film_Poster.jpg",
    "thumbnail_width": 236,
    "thumbnail_height": 350,
    "imdb":7.6
  },
  {
    "title": "The Sonata",
    "year": 2020,
    "cast": [
      "Freya Tingley",
      "Simon Abkarian",
      "Rutger Hauer",
      "James Faulkner"
    ],
    "genres": [
      "Mystery",
      "Thriller"
    ],
    "href": "The_Sonata_(film)",
    "extract": "The Sonata is a 2018 mystery thriller film, directed by Andrew Desmond, from a screenplay by Desmond and Arthur Morin. It stars Freya Tingley, Simon Abkarian, James Faulkner, Rutger Hauer, Matt Barber and James Kermack. It was released in the United States on January 10, 2020, by Screen Media Films. It grossed $146,595 at the box office and received mixed reviews from critics.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/13/The_Sonata_%282018%29_Film_Poster.jpg",
    "thumbnail_width": 246,
    "thumbnail_height": 350,
    "imdb":7.6
  }
]